[{"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/PSqvLuq-CYQ/story01.htm", "corpus": "You've decided to get an iPhone 6 or an iPhone 6 Plus, and now it's time to figure out which carrier to go with. In the U.S., the major carriers are Verizon, AT&T, T-Mobile and Sprint. All of them will carry the new phone, so how do you decide? We've gone over their plans and their coverage, and here are the details.\n\nEach of the big four carriers are the first out of the gate in the United States to offer the new iPhone models. And each are trying to sweeten the pot to get customers to jump at the new iPhones too. Some are giving billing credit incentives, some are offering generous trade-in allowances for working phones, and more.\n\nRegardless of which carrier you choose, the 16 GB iPhone 6 will start at $199 on contract, with $299 on contract the base price for the larger iPhone 6 Plus. Add $100 to increase either phone from 16 GB to 64 GB, and another $100 for 128 GB.\n\nOver the past year all four companies have changed the way they handle phone sales, all with an emphasis on helping you turn over your phone more quickly.\n\nFor Verizon, it's called Edge — buy an iPhone in 20 payments. After 30 days and once you've paid off 60 percent of the cost of the phone, you're eligible for an upgrade. Verizon is also giving a $200 credit if you buy a new iPhone 6 (not the 6 Plus) from them, assuming you're willing to trade in an iPhone 4 or newer and agree to a new two-year contract. They're billing this as a \"free iPhone 6.\" Not quite, but a $200 trade-in gift card may be a strong incentive for some customers.\n\nAT&T's program is called Next. It's 20 monthly payments as well, but you're not qualified to upgrade until the 12th installment. (There's a 24 month, 18th installment version available too). Once you upgrade, the cycle starts again. AT&T also incents customers to use Next by offering a $100 billing credit if you sign up. Like Verizon, AT&T's offering a trade-in credit for working phones, with a pretty generous allowance - you can get $200 for a working, unblemished iPhone 4.\n\nSprint's new program is called \"iPhone for Life,\" and it's specifically geared towards customers interested in the new iPhone models. You can get the 6 or the 6 Plus for $20 per month. And after 24 months, you can trade in your old phone for a new one. It's essentially a leasing arrangement that makes you pay out $480 for the privilege of using the phone, then turning it in when you're eligible for a new one. You can get up to $300 in credit for an eligible iPhone trade-in.\n\nT-Mobile breaks up the cost of the iPhone over 24 months, and your cost depends on your credit (with a 16 GB iPhone 6 starting at $27.08 a month). The company offers a trade-up upgrade called Jump that lets you upgrade as soon as you've paid off 50 percent of the balance of the phone. T-Mobile is also offering its customers a trade-in value guarantee: They'll meet or beat all the other major carriers' deals, and if you find a better deal within seven days, you'll get the difference back plus $50.\n\nIt's enough to make your head spin. There are a lot of different plans available from each wireless company. What you'll pay depends on how many lines you're managing and how much bandwidth you're willing to pay for, but here's a quick breakdown. I'm going to focus on each company's shared plans for now, since so much consumer attention is focused on that right now. All the plans offer unlimited domestic talk and text.\n\nVerizon's program is called \"More Everything.\" A pool of data that can be shared on up to ten devices (smartphones, tablets and so on), personal hotspot support for your iPhone, and some other perks, like cloud storage, international messaging and more. Line access for each phone costs $40, with a fee for data on top of that which varies depending on how much bandwidth you're paying for. Verizon incents its customers to enroll in its Edge program by offering them $10 off per smartphone for the More Everything plan.\n\nAT&T's variation is called Mobile Share. Just like Verizon, up to 10 devices can share a pooled data allotment. International messaging, and 50 GB of free cloud storage using AT&T's Locker service. Plan charges start at $20 per month for 300 MB of data, running up to $375 for 50 GB of data, with lots of stops in-between. Each smartphone costs $40 for line access, though you get a better price break than you do with Verizon if you're in AT&T's Next upgrade program: 6 GB or less data plans knock that line service fee down to $25 per month; 10 GB or more play only $15 per month for each smartphone line.\n\nSprint's new Family Share plan waives monthly access charges through 2015. Up to ten devices can be connected, with data plans available ranging from 1 GB per device to 6 GB per device. The company is also pushing a single-line unlimited data offer for iPhone customers for $50 per month.\n\nT-Mobile's Simple Choice plan lets you scale savings based on how many lines you need. You can pick and choose data allotments for each line, with 2.5 GB to unlimited data available. T-Mobile also offers unlimited data and text in more than 120 countries, along with music streaming that doesn't count against your data cap, and a recently announced deal that gets you Visual Voicemail and texting capabilities on board airplanes equipped with GoGo Wi-Fi.\n\nVerizon remains the dominant player in the U.S. market, with the biggest 4G LTE network and the biggest footprint. After focusing on modernizing their network over the past few years and migrating to 4G LTE, They've spent a lot of 2014 building out capacity to improve network congestion in urban areas. However, you will pay for the privilege. Verizon isn't the most competitive on price, simply because they don't have to be.\n\nOne problem that Verizon has faced with the iPhone in the past is going away: simultaneous voice and data communication; namely, that iPhones on Verizon's network couldn't do it. That's changing thanks to two factors: Verizon will soon bringing online Voice over LTE (VoLTE), voice call technology that is encoded as data instead of a dedicated radio channel, and the iPhone 6 can do VoLTE. So users in the past who were worried about not being able to access the web while they were talking, or pull up map information and so on, won't need to worry going forward.\n\nAT&T is second to Verizon in terms of customer base, but the company hasn't let that stop it from aggressively building out its 4G LTE network. AT&T boasts better reliability than the competition, with high scores from independent testers for call quality and Internet speed.\n\nWhile VoLTE will level the voice/data playing field in the future, AT&T's use of the GSM networking standard makes simultaneous voice/data communication the way things have long worked on their network, so you don't need to worry about the switch getting flipped in the future — it works now, just as it always has.\n\nSprint's been playing catchup as they build out capacity and speed on their 4G LTE network. They've tried to make up for it by offering some really good deals to sign up new customers, which makes them an attractive offer for bargain-hunting mobile users looking for the best possible deals.\n\nThere's a big glimmer of hope from the iPhone 6 - it's the first iPhone to support Sprint's \"Spark\" service, which offers faster data speeds on their network. It's something already available on some Android phones, but the iPhone 6 will be Apple's first phone to support Spark.\n\nshook up the mobile industry in the U.S. a year ago with their \"Uncarrier\" program. It seems like every month or two they're giving customers a new reason to come, whether it's eating Early Termination Fees (ETFs) for customers switching mid-contract, making music-streaming available without dinging your data allotment, free Visual Voicemail and texting on some Wi-Fi equipped airplanes, and more.\n\nThey're also aggressively building out their 4G LTE footprint and really have improved their network over the past year. They still have a long way to go before they'll catch up to AT&T, but their customer-friendly attitude and their simplified pricing plans make them an attractive choice for a growing number of mobile users.\n\nIf you're not sure which carrier to go with, pop on over to our iPhone discussion forums and chat with the fine folks there, or drop a message here and hear what others have to say.", "wordchoice": ["first", "the", "VoLTE", "will", "starting", "and", "an", "per", "iPhone", "re", "need", "an"], "title": "Verizon vs AT&T vs T-Mobile vs Sprint: Which American iPhone 6 or iPhone 6 Plus carrier should you choose?"}, {"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/1awe455sTIU/story01.htm", "corpus": "Canadian wireless carrier Rogers has confirmed that pre-orders for Apple's iPhone 6 and iPhone 6 Plus will commence at 5 AM Eastern Time on September 12, which is 2 AM Pacific Time. It looks like Rogers will be adhering to a different time table than the 12:01 AM Pacific Time that is anticipated for when Apple takes pre-orders, at least in the U.S. market.\n\n\"The Rogers Reservation System will open tomorrow September 12, 2014 at 5 a.m. ET,\" the carrier wrote in an email to customers who had pre-registered their interest in the iPhone. \"We'll send you further information including a link to our Rogers Reservation System bright and early tomorrow morning.\"\n\nWill you be waking up early to pre-order on Rogers? Or will you try and order directly from Apple?\n\nIn the interim, be sure to visit our iPhone Buyer's Guide.", "wordchoice": ["Pacific", "Apple", "tomorrow", "the", "least", "will", "interim", "September", "open", "table", "order", "you"], "title": "iPhone 6, iPhone 6 Plus pre-orders start at 5 AM ET on Rogers"}, {"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/-XQGvYNUwiU/story01.htm", "corpus": "Tim Cook and company's one more thing this year already launched with a number of skin sensors to measure heart rate and keep the Apple Watch secure when using it for payments with Apple Pay, but health fanatics may want to sit out the first generation. Though the Apple Watch does plenty, Apple is said to be bundling even more sensors to expand the Apple Watch's health tracking capabilities in a future hardware revision.\n\n\"Two people familiar with Apple's plans told Reuters the company is planning to unveil richer health features and additional sensors in later versions, the first iteration not hitting the market until early 2015,\" Reuters reported.\n\nGiven that the Apple Watch won't be available for purchase until 2015, Apple may not have announced all of the device's features. So while we may know many of the capabilities of the Apple Watch and its design, Apple could still have a one more thing when it comes to the Apple Watch's list of features.\n\nSimilarly, Motorola did not announce the heart rate sensor nor the wireless charging feature when the Moto 360 was introduced alongside Google's Android Wear platform, with disclosures of the full capabilities of the Moto 360 coming days ahead of the watch being made available for pre-orders. Apple may likely have a few surprises still in store for the Apple Watch to keep pundits on their toes.\n\nRight now, despite the advanced capabilities of the Apple Watch, it still doesn't offer standalone sleep tracking or GPS tracking information without being tethered to an iPhone.\n\nAnd Reuters admits that Apple may purposefully be building a low-key fitness product to stay under the FDA's radar to avoid additional regulatory scrutiny. Once the Apple Watch is considered a \"health\" rather than a fitness accessory, it may be subjected to additional FDA review.\n\nWhat do you think of the Apple Watch and Apple's strategy? Will you be buying one come 2015 or will you be holding out for a second generation model that likely will do more?", "wordchoice": ["a", "the", "avoid", "for", "still", "features", "under", "iteration", "with", "announced", "strategy", "Apple"], "title": "Next generation Apple Watch could appease health fanatics with even more sensors"}, {"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/y_waE44sHSs/story01.htm", "corpus": "If you're in the U.K, choosing a carrier for your new iPhone 6 or iPhone 6 Plus is as tough as ever. We've now got LTE support across the country from all the major carriers, even some of the MVNOs are starting to get in on that and pricing is become every more competitive. Add to that increasing competition from high-street retailers to get your business and it can become a real challenge to hunt down the best deal.\n\nThat's where we come in. We've rounded up the best the major players have to offer so you don't have to!\n\nWhile last year 4G LTE was still in its relative infancy when the iPhone 5s launched, this year all the major carriers can boast significant and ever increasing coverage. With the headstart it had, EE can still boast higher download speeds and more areas covered, but they're no longer the only big player. O2, Vodafone and even Three have all started their aggressive rollouts of LTE data and various deals to lock you in to for 2-years. As with last year, calls and texts aren't really an issue anymore since most contracts offer unlimited or very high allowances of both.\n\nAt the time of writing there aren't any subsidized prices available – we'll be back with those when pre-orders have gone live – but also worth considering are some of the SIM only deals available from each of them. If you're happy to pay the full retail price for your iPhone by buying it from Apple you can save yourself some of the monthly outlay while still getting a good amount of data. Check out this next chart for a roundup of some of the best SIM only options for 4G LTE data.\n\nSomething else worth considering is Wifi calling. Introduced with iOS 8, EE has already announced its intentions to support Wifi calling. Three and O2 will also allow you to do the same, though you need to download a separate application to allow you to do it.\n\nThere are numerous smaller MVNO carriers in the UK, but the two biggest to consider are Virgin Media and GiffGaff. Both offer good signal, and good packages on a SIM only basis to prospective iPhone buyers. On GiffGaff you're looking at paying £12 a month upwards for packages with unlimited data but without tethering included. Compared to the main carriers these 30-day rolling deals offer an extremely compelling package.\n\nVirgin Media offers a range of packages but as ever those who are already customers on one of the suppliers TV or broadband packages will get the best deals. As such, Virgin is probably only worth really considering if you fall into this category. Tariffs with 1GB of data and up start from just £10 a month on a 30-day rolling arrangement. 2GB will cost £15 and for unlimited of everything you're going to pay a pretty reasonable £18 a month.\n\nThen there's coverage to take into account. After all, there's little point paying out if you're not going to be getting what you're paying for. Generally the big four all have excellent coverage nationwide, with the usual blackspots to be expected. The best thing to do is to check out the coverage maps at the links below for each of them.\n\nAnd, since two of the bigger MVNOs, Virgin and GiffGaff that we mentioned above, use EE and O2 signal respectively, check out those carriers maps for more information on those.\n\nOne of the strengths here is O2 Refresh, where the phone and the cellular connection are split apart from each other. Each incurs a cost that combines to make one monthly payment, but the net result is a potentially cheaper way to upgrade next year to the next iPhone. You won't have to buy out your whole remaining contract, just the amount you still owe on the phone, and then you get to start all over again.\n\nOn the SIM only front, O2 isn't the most expensive options and you can find a good compromise of data packages at reasonable prices should you be willing to lock in for 12 months.\n\nAnd of course, if you get great O2 signal where you are, they're worth a look.\n\nEE has more coverage than the other LTE enabled carriers so far, and has even rolled out double-speed data in certain locations such as London and Birmingham. The network that came together as a combined effort of Orange and T-Mobile has solid signal across most of the UK, and also has a decent reputation for working indoors.\n\nEE has recently shaken up its price plans a little and the biggest thing missing on a SIM only basis is a really high data cap offering as you get with most of the other UK carriers. But if you're in an area well served by EE LTE signal, particularly the double-speed, then it's certainly worth a look.\n\nAt this point, the strongest argument is that if the signal in your area is strongest on Vodafone, then go with them. Their LTE offering is improved on 12 months ago but their tariffs are still more expensive when you get towards the higher tiers of data allowance than the competition. But, Vodafone does offer higher allowances on a SIM only basis than EE, which is another point in its favour.\n\nLong serving customers and folks who enjoy the best signal are best suited to Vodafone.\n\nIf you want unlimited data, properly unlimited data, then Three is the one to beat. New customers still get unlimited mobile data but it no longer includes unlimited tethering. Only customers on an existing contract will be grandfathered in to that so if it's important to you you're probably better buying a new iPhone outright. There's a misconception that Three signal isn't great, but those days are over with the majority of the UK now covered.\n\nThree's LTE rollout is now in full swing but it's not yet covering wide areas of the UK. But its HSPA+ network offers some pretty astounding speeds as it is, with 20Mbps+ down on tap in many areas.\n\nThree is the single best choice for the truly data hungry iPhone owner.\n\nIf you can afford to buy an iPhone 6 or iPhone 6 Plus outright from an Apple Store, there's no reason not to look at one of these two. Signal is pretty great and without the phone to worry about paying for your monthly bill will be much lower than on one of the big four carriers who want to sell you the phone as well, and on a SIM only basis both are extremely competitive without requiring you to be locked into a contract for more than 30 days at a time.\n\nIf you're still not sure about which UK carrier to get for your new iPhone 6, iPhone 6 Plus or even if you're going to pick up a new iPhone 5s or iPhone 5c jump into our iPhone discussion forums and the best community in mobile will happily help you out. Then let me know - which one did you go with and why?", "wordchoice": ["Add", "UK", "than", "expensive", "you", "have", "numerous", "15", "amount", "a", "increasing", "which"], "title": "Three, O2, EE, or Vodafone: Which UK iPhone 6 or iPhone 6 Plus carrier should you choose?"}, {"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/rNWm1kS5k14/story01.htm", "corpus": "If you've received an iTunes Store, iBook Store, or App Store gift card or promo code, you can redeem them using iTunes on your computer or even more conveniently — straight from your iPhone and iPad. Here's how to cash in your codes on iOS and on the go!\n\nIf for some reason your camera won't grab the code, you can tap You can also enter your code manually and enter the code as shown below. This may need to be used on older cards where or in some countries where codes are presented differently.\n\nJust like redeeming App Store gift cards, if your camera won't grab the code, you can enter it manually through the iTunes app as well by following the exact same steps.", "wordchoice": ["through", "ve", "enter", "if", "cards", "used", "go", "cards", "on", "are", "as", "or"], "title": "How to redeem gift cards and app promo codes straight from your iPhone and iPad"}, {"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/KMrQQ-n_DgY/story01.htm", "corpus": "Once you've decided you're getting a new iPhone 6 Plus or iPhone 6, and picked your model, capacity, and color, you still need to choose your carrier. If you're in Canada, that means the big three carriers of Rogers, Bell, and TELUS, their lower-price subsidiaries, and a few upstarts. All of the big three have confirmed that they'll be offering the latest and greatest iPhones, though none of them have nailed down pricing. Apple announced $299 on a two-year plan for the 16 GB iPhone 6 Plus, and $199 on contract for the 16 GB iPhone 6, and it's safe to assume the Canadian carriers will stay in line with that. So which carrier should you go with? We've chewed through the plans and coverage, and here's what we've found!\n\nAcross the board, we're expecting the 16 GB iPhone 6 will be $199 on contract, $299 for the 64 GB version, and $399 for the 128 GB model. The iPhone 6 Plus should start at $299 on contract for the 16 GB model, $399 on contract for the 64 GB version, and $499 on contract for the 128 GB iPhone 6 Plus.\n\nThe big three Canadian carriers all work on what's effectively a pro-rated early termination fee now. It used to be that if you cut your contract early, it was more or less a flat fee based on how many months you had left on your contract, capping out at around $400. Now the subsidy you take on your phone is factored in with how long you have left on your contract. Rogers calls this system FLEXtab, TELUS calls it Device Balance, and Bell calls it Data Service Agreement Price Adjustment.\n\nBasically, if you get $500 off the price of your $700 device, it would be about $250 to get out of your contract a year early. That $500 discount gets paid off in equal increments every month in your term (so, $500/24 = $20.83). After 12 months, you will have paid back $250 of that balance, leaving the other half to be paid off before you leave. When you're halfway through your contract, you're halfway to paying back your subsidy.\n\nMonthly rates across all three are suspiciously identical, and all Canadian carriers allow you to share your data to an iPad for another $10/month.\n\nBell and TELUS share the same towers for their GSM/LTE network but have different back-hauls (different connections to the internet from the towers). That means the Bell/TELUS tower near your home, school, or work could still provide better speeds on one or the other networks.\n\nEach of the big three carriers owns a subsidiary that typically offers lower-cost options by way of a tab system, similar to what the big three are using. Rogers owns Fido. Bell owns Virgin Mobile. TELUS owns Koodo. All three have announced they'll be carrying the iPhone 6 and iPhone 6 Plus. They're great options if you want a balance of subsidized cost up-front and contract flexibility.\n\nIf you're really want an alternative, you also have the option to buy the 6 Plus unlocked starting at $749 or iPhone 6 starting at $649, and run with WIND or Mobilicity. They have great plans starting at $25. It ends up being cheaper in the long run, just keep in mind that you'll be missing out on LTE.\n\nRegion-specific carriers are also out there, like Sasktel, MTS, and Videotron. Typically they'll have roaming agreements in place if you ever leave your hometown. Decent data plans will typically start at about $50/month, which can certainly be cheaper than going with Rogers, Bell, or TELUS.\n\nRogers is the big boy on the block. Of course all of the major centers are covered with Rogers LTE, including Toronto, Vancouver, Montreal, Ottawa, Calgary, Regina, Edmonton, and lots of others. Recent expansions include a bunch across Quebec, such as Greater Montreal Area (East), Granby, Lachute, Saguenay, Saint-Hyacinthe and Bromont. Data overages cost $15 / GB.\n\nIf you're in those areas and speed matters more to you than money, go with Rogers.\n\nFor coverage, you'll see that there are a few areas where Bell reaches that others don't, namely up north. Bell regularly boasts to having Canada's largest LTE network. When it comes to speed, Bell has the same kind of 150 Mbps LTE as Rogers in the Greater Toronto Area, Cambridge, and Kitchener-Waterloo. Data overages are $0.05/MB, which is on par with TELUS, and way more pricey than Rogers.\n\nJust looking at the coverage map, Bell is a good choice if you're in the Prairies, Maritimes, or up north.\n\nYou can see from the coverage map that the Ontario corridor is well covered by TELUS, as well as the Maritimes. Alberta's also looking pretty good, and it there's even some decent service in the Northwest Territories. TELUS network speeds peak out at around 75 Mbps, which is a little slower than Bell and Rogers at their fastest. Data overages are $5 / 100 MB for first 1500 MB, and $0.05 / MB after first 1500 MB, which is considerably more steep than Rogers' overage rate, and roughly the same as Bell.\n\nCoverage may again be a deciding factor when going with TELUS, but anecdotally, you may find their customer service a little bit better than the other two. TELUS subsidiary Koodo has ranked pretty well on that front.\n\nHere's where it gets more complicated. If you have an unlocked iPhone and are simply looking for a SIM card to place in it, you have a ton of options from Fido, Virgin Mobile, and more. If saving money is absolutely the most important thing to you, figure out the barest minimum voice, data, and extras like messaging you need, and then check out someone like Virgin Mobile. You'll get a great deal.\n\nIf you're still not sure about which Canadian carrier to get for your iPhone 6 Plus or iPhone 6, jump into our iPhone discussion forums and the best community in mobile will happily help you out. Then let me know - which one did you go with and why?", "wordchoice": ["contract", "Each", "on", "school", "Bell", "TELUS", "data", "will", "confirmed", "also", "iPhone", "your"], "title": "Rogers vs. Bell vs. TELUS: Which Canadian iPhone 6 or iPhone 6 Plus carrier should you sign up with?"}, {"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/1i1ROl5fQKs/story01.htm", "corpus": "Come tonight, customers who are ordering the iPhone 6 and iPhone 6 Plus can either have their phone of choice shipped to them or they can pick up in the store. Given the new screen sizes and resolutions, along with the new functionality and features that are coming with iOS 8, the ability to pick up, and also have your iPhone set up by an Apple associate in a store, may be a good option for new and returning iOS customers who need a little extra attention.\n\n\"Pre-order iPhone 6 and have it shipped to you for free, or pick it up in store,\" Apple said on its website.\n\nAs in years past, Apple will likely deplete its initial inventory of iPhone units fast, so customers who want to be the first on the block to own an iPhone should pre-order in advance.\n\nWill you stay up late tonight or wake up early to pre-order? And will you have the iPhone shipped to the comfort of your own home or will you head to the launch day frenzy at Apple retail stores? Stores should open by 8 AM on Friday, September 19 when the iPhone becomes available.", "wordchoice": ["Apple", "returning", "iPhone", "coming", "to", "the", "September", "September", "advance", "a", "should", "and"], "title": "In-store pickup may be available for tonight's iPhone 6 pre-orders"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/z7VOsixY2N4/rumors-claim-next-generation-apple-watch-will-include-sensors.html", "corpus": "Despite the fact that the Apple Watch was just announced on September 9, and the device doesn’t even launch until the early part of 2015, a new report is already circulating about what some next variation of the device will feature.\n\nAccording to the new report from Reuters, the next-generation Apple Watch will come with even more sensors, and even “richer health features.”\n\n“Observers say there is little evidence for now that the device’s fitness capabilities surpass the competition. Others, hoping for groundbreaking health features from a company whose Chief Executive Officer Tim Cook spoke of how sensors are “set to explode,” were left wondering what’s in store for the product. Two people familiar with Apple’s plans told Reuters the company is planning to unveil richer health features and additional sensors in later versions, the first iteration not hitting the market until early 2015.“\n\nThere’s no doubt that this report probably stems from plenty of rumors that were filling the Rumor Mill before the Watch was announced, including reports that the device would feature up to 10 sensors, all tuned towards health. It is admittedly slightly ridiculous that the device is barely official, and not even in the wild yet, and new rumors about future devices are already cropping up.", "wordchoice": ["health", "device", "already", "barely", "s", "was", "to", "were", "was", "Executive", "s", "explode"], "title": "Rumors claim next-generation Apple Watch will include more sensors"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/aotBNZa2W8Q/iphone-6-or-iphone-6-plus.html", "corpus": "At 12:01AM PT tonight, the iPhone 6 and iPhone 6 Plus, Apple’s newest iPhones, will be available for pre-order from Apple’s website. Pre-ordering iPhone 6 or iPhone 6 Plus will ensure that you will get your new iPhone on the launch day, September 19th.\n\nThis is the first time the iPhone lineup has two flagship devices: the iPhone 6 and iPhone 6 Plus. There are several common improvements among the two, like a better camera, faster processor, larger storage capacities, all-new design, and more, but there are also a few differences between the two. The first is of course the display size — the iPhone 6 has a 4.7-inch 1334 x 750 pixels display while the iPhone 6 Plus has a 5.5-inch 1920 x 1080 pixels display. The iPhone 6 Plus also has longer battery life and optical image stabilisation.\n\nSo the question is: Which iPhone 6 will you be buying? If you need help, check out these articles:\n\nLet us know which iPhone 6 you plan to buy by taking this poll and feel free to leave a comment to tell us the reason.", "wordchoice": ["storage", "5", "of", "or", "6", "6", "iPhones", "is", "inch", "12", "has", "pixels"], "title": "Are you planning to buy iPhone 6 or iPhone 6 Plus?"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/t1-FXL4K0Sw/iphone-6-hands-on-videos.html", "corpus": "Apple unveiled the iPhone 6 earlier this week during its special event at Flint Center in Cupertino, and let reporters at the event get some hands-on time with the device. Read on to find out what they have to say about it.\n\nBecause they only had a short time with the device, these first impressions focus on a small part of the package. Some offer comments on the performance based on observation and not benchmarks. The real reviews will come when the phone lands in the hands of reviewers and they get some quality time with device.\n\nFor people not interested in the larger iPhone 6 Plus, there is the iPhone 6. I have absolutely no concerns about the iPhone 6 and its larger screen. It fit comfortably in my hands and allowed for one-handed use throughout all apps I tried. Upgrading to the iPhone 6 will be like upgrading from an iPhone 5 to an iPhone 5S—yes, it’s bigger, but it’s also very comfortable. It will be a very easy upgrade for most people. That said, I’d be hard pressed to guess which model will be the top seller for Apple. The company has proven in the past that the inexpensive model isn’t always the top seller. I think many people will be like me and need to see it in person and see how it feels. It’s a departure for Apple, but one they could make work with iOS 8 and the special gestures incorporated into the software.\n\nWhile the new iPhone 6 isn’t lighter than the iPhone 5, it feels incredibly thin compared to the iPhone 5s I had on hand for comparisons. In terms of the design of the device, it’s clear that Apple had to break some trends that seemed to be present in previous iPhones. For one, the noticeable camera bump came from a need to maintain and/or improve camera quality while simultaneously driving down z-height overall, so there seems to have been an industrial design trade-off here for the sake of functionality. There’s also the relatively thick plastic lines which are a departure from previous designs but seem to be necessary for NFC capabilities. I’m personally unsure how I feel on these two design elements, but they may be an issue for some.\n\nThe back of the phones are made out of aluminum with some clearly visible cutouts made to allow wireless signals in and out. The design as a whole is more reminiscent of the 2012 iPod Touch than current iPhones, an observation that extends to the slightly protruding camera lens. You won’t notice this bulge if you keep your phone in a case or sit it on a soft surface, but if you set the phone on a hard table it definitely will wobble a bit in place. Both phones feel lighter than you’d expect them to—4.55 ounces for the 6 and 6.07 ounces for the 6 Plus, compared to 5.64 ounces for the 5-inch HTC One M8 or 5.08 ounces for the new Moto X—but they still feel as sturdy as you’d expect from an Apple product.\n\nIn the hand, the iPhone 6 definitely feels noticeably larger, but what’s remarkable is that it doesn’t feel significantly bulky. The rounded sides and thin, lightweight chassis kind of harken back to older devices, in fact, like the iPhone 3GS and earlier, but the more premium materials used here add another dimension of quality. Playing with the new camera reveals the improvements there are also impressive. The iPhone 6 gets all the new features besides optical image stabilization, including slow motion video at 240 FPS, which is two times faster than the iPhone 5s (and so two times slower when played back). The camera’s autofocus is fast and effective thanks to the addition of phase detection, and it no longer highlights the point of focus, which it doesn’t really need to because of its improvements.\n\nNaturally, there’s going to be some hesitation by those who’ve been used to the 3.5-inch or 4-inch size of all previous generations of the iPhone, but the 4.7-inch model is still reasonable enough that most users should easily get used to the new size. At 6.9mm, it’s thinner than the 5s (7.6mm), and its curved sides bring a sleek look that should still be plenty comfortable for most traditional iPhone fans. I had no problem gripping the iPhone 6, and it felt right at home in my palms.\n\nAt 4.7-inches, the device doesn’t feel big; the thinness might help perpetuate that illusion, or maybe it’s just that we’re used to from bigger devices. It’s also really light, and the power button being moved to the right side is in the perfect spot. You won’t have to stretch your hand up to the top just to sleep/wake your device. It looks like a major step up from the iPhone 5s, and we know how much Apple fans loved that design.\n\nWhen you are done reading the early first impressions, you can voice your opinion on the iPhone 6 in the comments. Do you like it, hate it or don’t care?", "wordchoice": ["it", "more", "and", "special", "to", "s", "6", "one", "it", "visible", "5", "make"], "title": "iPhone 6: Hands-on video and first impressions"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/QPx-XAI9fUo/apples-slim-12-inch-macbook-allegedly-still-works-coming-mid-2015-silver-gold-space-gray.html", "corpus": "A 12-inch MacBook is one rumor that just outright refuses to go away. Now, a new report breathes fresh air into it all over again, but this time throws in a bit of color for good measure.\n\nAccording to Jack March for A Tech Website, Apple’s 12-inch notebook is still very much in the works. Despite rumors that had placed it launching in mid-2014, it looks like Apple is now planning a mid-2015 launch of the new MacBook. Previous rumors had suggested that, if not in mid-2014, then late in the same year, or early 2015. The report also claims, which is quite new for this sort of thing, that Apple is planning to launch the new laptop in not only a silver and space gray option, but also gold.\n\nThis would match the color scheme offered by the iPhone lineup (iPhone 5s, iPhone 6 and iPhone 6 Plus).\n\n“The most fascinating part of this report is that Apple is also planning to change the colours for the first time with an Aluminium MacBook, the source says that Apple is planning to add Space Grey and Gold colours to their MacBook lineup, which would be consistent with the colours on the iPhone 6.“\n\nWhat’s even more interesting, is that MacRumors believes this report actually has merit, and that Apple could indeed be planning to launch “special edition” 12-inch MacBooks in 2015. According to the initial report, Apple has continuously shifted development of the 12-inch MacBook, which is allegedly the reason why it has been “delayed” so often.", "wordchoice": ["looks", "new", "match", "Apple", "12", "very", "why", "believes", "lineup", "the", "to", "like"], "title": "Apple's slim 12-inch MacBook allegedly still in the works, coming mid-2015 in silver, gold and space gray"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/l70-jQWGGfU/iphone-6-and-iphone-6-plus-buyers-guide.html", "corpus": "Preorders for the iPhone 6 and iPhone 6 Plus start at 12:01AM PT tonight, and if you intend on purchasing the new iPhone, here’s a buyers guide telling you everything you need to know.\n\nShould you upgrade to the iPhone 6 or iPhone 6 Plus\n\nThe first factor is of course if you should upgrade or not. The iPhone 6 and iPhone 6 Plus have a whole bunch of new features, including a larger display, a better camera, a faster processor, a longer battery life and more. If you’ve completed your contract, the iPhone 6 starts at $199 and the iPhone 6 Plus starts at $299, both for the 16GB model with 64GB, and 128GB configurations available as well.\n\nShould you upgrade to iPhone 6 or iPhone 6 Plus from your current iPhone\n\nOnce you’ve decided you want to upgrade, the next question is “Which iPhone 6 variant do you choose?” The iPhone lineup had just one top-of-the-line model earlier, but this time there are two flagship models, the iPhone 6 and the iPhone 6 Plus.\n\niPhone 6 vs iPhone 6 Plus: Does size really matter?\n\nIf you are considering switching carriers and finding the best plan for you based on cost and what each package includes in terms of talk, text and data, we’ve done the homework for you and prepared a guide:\n\nAT&T vs. Verizon vs. Sprint vs. T-Mobile: Which iPhone 6 carrier to choose based on cost\n\nThe next step is deciding which storage capacity to buy. Apple changed the storage configurations with the iPhone 6. While the lineup starts at 16GB, the next model isn’t 32GB, it’s 64GB, and the top storage capacity is 128GB. The choice here is heavily dependant on your usage patterns. If you use a lot of cloud storage and streaming services, then you’ll likely be ok with the 16GB model. If you shoot a lot of photos and videos or like playing heavy games, then you might want to go with the 64GB or 128GB option.\n\n16GB, 64GB or 128GB — Which iPhone 6 or iPhone 6 Plus storage capacity should you buy\n\nThe iPhone 6 and iPhone 6 Plus come in three colors: Space Gray, Gold and Silver. While the preference for a color is subjective, we have a post talking you through the three different choices.\n\nSpace Gray, Gold or Silver — Which color iPhone 6 or iPhone 6 Plus should you buy\n\nIt is a wise idea to consider the various insurance options available to protect your expensive purchase. There are several protection plans and insurance plans available for the iPhone, that cover your costs if the iPhone suffers accidental damage. These include AppleCare+, SquareTrade, Credit Card warranties and more, and we walk you through each of the options in the post linked below.\n\niPhone 6 and iPhone 6 Plus Insurance: AppleCare vs. Other Warranties\n\nWhere to sell your current iPhone\n\nYou can sell your current iPhone through a number of ways and use the extra cash towards your iPhone 6 purchase. There are a number of websites like NextWorth, Gazelle that specialise in dealing with used gadgets, but you can also sell it via eBay or Craigslist. Many carriers and retailers, including Apple, have their own trade-in program, where you can get store credit or discounts when you bring in your old iPhone.\n\nBest Places to sell your used iPhone to buy the iPhone 6\n\nWill you be preordering the iPhone 6 or iPhone 6 Plus? Let us know in the comments below.", "wordchoice": ["iPhone", "Best", "you", "camera", "and", "use", "iPhone", "sell", "cost", "through", "then", "done"], "title": "iPhone 6 and iPhone 6 Plus Buyers Guide"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/rRPRCJcnLas/iphone-6-applecare-vs-other-warranties.html", "corpus": "If you are planning on purchasing the new iPhone 6 or iPhone 6 Plus when they are available later this month, it would probably be wise to consider the various insurance options available to protect your expensive purchase. In this column, join us as we do a side-by-side comparison of AppleCare with other warranty plans available.\n\nLet’s be clear about something that a lot of people might not realize off the top: when you purchase an iPhone 6 or any Apple device, it is automatically covered under a one-year limited warranty for no additional cost. It doesn’t matter if you purchased the device directly from Apple, or through Amazon, Best Buy or any Apple authorized reseller.\n\nAs this warranty plan is cost free, you can probably imagine that it is fairly limited in scope. Essentially, the only two things that are covered are the iPhone 6’s hardware and any consumable parts — in other words, the battery — if they are damaged or dysfunctional due to a manufacturing defect. Plus, 90 days of complimentary phone support.\n\nFortunately, a few years ago, AppleCare+ was introduced. This warranty plan, which has supplemented the standard AppleCare in most countries, expands your coverage areas, provides you with more customer service options and covers accidental damage under certain conditions.\n\nAppleCare+ doubles your one-year limited warranty plan to two years from the original purchase date of the device, in addition to extending your complimentary phone support from 90 days to 2 years. You must purchase this plan within 60 days purchasing your iPhone 6 and provide that your device is undamaged and in proper working order.\n\nAppleCare+ will set you back a one-time payment of $99 if you are purchasing the warranty plan for an iPhone 6. That might sound like an unnecessary additional cost, but the good thing about AppleCare+ is that it covers up to two incidents of accidental damage for a $79 service fee. In most cases, that’s a lot cheaper than fixing your iPhone yourself.\n\nImagine this: it is a hot summer day and you are ready to go swimming in your friend’s pool in his or her backyard. You’re excited to escape the heat and cool off in the water, get your bathing suit on and jump right in. A few seconds later, you realize that your iPhone was in your pocket. Frantically, you get out of the pool and assess the damage.\n\nA quick Google search has told you to put the soaked iPhone in a bowl of rice to dry out, but it is of little use. Your iPhone is dead. Accidents happen, and that’s where AppleCare+ can save your behind for a fraction of the cost that Apple authorized service would cost.\n\nIn addition to covering accidental physical or water damage, AppleCare+ will also replace your defective or broken iPhone headphones or Lightning cable and a battery that has depleted by more than 50 percent within your warranty coverage period. What’s not covered includes a lost or stolen device, normal wear and tear and software problems.\n\nApple also specifically outlines that jailbroken devices are not eligible for AppleCare+ coverage, since modifying your device in that manner is a violation of the company’s End User License Agreement (EULA). However, a quick restore of the device to factory settings through iTunes should remove all traces of jailbreaking.\n\nAppleCare+ applies internationally and is transferrable, meaning that if you purchase a used device still covered by the warranty plan, it remains in effect until its normal expiration date.\n\nIf you are a Visa, MasterCard, American Express or other credit card holder, be sure to consult one of these companies to see what kind of warranty coverage they might offer. In a lot of cases, you might be surprised to find out you are automatically covered for free or substantially less than a lot of third-party warranty plans cost.\n\nFor instance, based on personal knowledge, the RBC Visa in Canada has an Extended Warranty Insurance that is offered to all cardholders and doubles your manufacturer’s warranty — in this case, the one-year limited warranty on an iPhone 6 — from the date the manufacturer’s warranty expires. The policy applies for a maximum of five years.\n\nBefore you explore any other third-party warranties available, be sure to consult your credit card company for further information. A quick online search will usually yield information about your card issuer’s warranty options.\n\nYou have done your homework on credit card warranties and want to explore various third-party electronics warranty providers. Enter SquareTrade, which offers an iPhone protection plan that costs $5 per month, $99 for two years or $129 for three years and covers drops, spills and malfunctions for a $75 deductible.\n\nThe $99 upfront cost of SquareTrade is cheaper than insurance plans available through AT&T, Verizon, Sprint or Best Buy, and the $75 deductible is four dollars cheaper than what AppleCare+ charges. It’s important to note that, just as is the case with AppleCare, loss or theft of your iPhone is not covered.\n\nSquareTrade’s protection plan includes reimbursement for any Genius Bar repairs, same day repair at any local service shop and next-day replacement. The repairs that are reimbursed include a cracked screen, camera failure, battery failure, liquid damage, charging port failure, touchscreen malfunction, headphone jack problems and more.\n\nIt is highly recommended that you do not invest the money into a carrier or retailer insurance plan, as these warranties are often outsourced to third-party companies and charge exorbitant deductibles or monthly charges. For instance, paying a $10 monthly fee and $200 or so deductible through AT&T quickly adds up and makes it not worthwhile.\n\nInstead of shelling out additional money to AT&T, Verizon, Sprint or Best Buy, which the chart above shows clearly aren’t the cheapest options, you are probably much better off considering AppleCare+ or SquareTrade.\n\nOverall, choosing a warranty plan will depend on how much you are willing to spend, how well you take care of your iPhone and what is available in your area. A good starting point would be to purchase a durable case and screen protector for your iPhone, as drops and water damage are two common causes of broken devices.\n\nIs your iPhone covered by a warranty plan?", "wordchoice": ["for", "reimbursed", "applies", "heat", "6", "cheapest", "until", "this", "with", "limited", "retailer", "off"], "title": "iPhone 6 and iPhone 6 Plus Insurance"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/Oif3LviCoLE/apple-will-reportedly-offer-store-pickup-option-iphone-6-preorders.html", "corpus": "The iPhone 6 and the iPhone 6 Plus will go on sale in stores beginning September 19, but before then it will be available for preorder beginning September 12 for major wireless carriers at 12:01 AM PST. While Apple has yet to confirm their own preorder window, it’s believed they will follow suit. Now, a new report suggests another pickup option will be available after the preorder is made.\n\nAccording to the report published by 9to5Mac, they have independently confirmed that Apple will offer in-store pickup as an option once a preorder is made from their online store. The publication confirmed the option both with Apple’s online chat and physical Apple Retail locations. This means after you place your preorder, you will be able to choose a location in your area to pick up the device, instead of having it shipped to you.\n\nRelated, the official Apple iPhone retail page also suggests the same option:\n\n“The big day is coming. Pre-order iPhone 6 and have it shipped to you for free, or pick it up in store. You can also buy at the Apple Retail Store beginning at 8:00 a.m. on September 19.*“\n\nIt does sound like while the option will be available, it would do well for anyone wanting the option to keep an eye out for the selection during the preordering process:\n\n“In regards to store pickup, there will be options available for that at most stores, which will be indicated at the time of your order. The option will exist while supplies last.“\n\nDo you plan on preordering the iPhone 6? Which model?", "wordchoice": ["to", "it", "eye", "pick", "keep", "order", "The", "is", "while", "option", "store", "of"], "title": "Apple will reportedly offer in-store pickup option for iPhone 6 preorders"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/gJxJGBIh1xQ/", "corpus": "Future versions of the Apple Watch will focus more on health-related tracking, reports Reuters this afternoon. Citing people familiar with the company’s project, the outlet says that it plans to include “richer health features and additional sensors” in later generation models.\n\nThis would certainly appease those in the healthcare industry, and fitness junkies, who expected Apple to unveil a smartwatch earlier this week with groundbreaking health features. Instead, it merely tracks your heart rate, and movements via an iPhone’s Wi-Fi and GPS.\n\nIn the run-up to this week’s event, several rumors suggested the Apple Watch would be much more health-focused. The Wall Street Journal, for example, said the device would feature “more than 10 sensors,” and another report called for blood glucose and sweat monitors.\n\nBut none of these things made it into the final version, which was unveiled on Tuesday, either due to size or power limitations. It could have also been regulatory-related, and Apple intentionally downplayed health benefits of the Watch to avoid unwanted attention from the FDA.\n\nIf nothing else, Reuters’ report reminds us that the Apple Watch is just in its first iteration, and it will be upgraded just like the iPhone and iPad with more features, better hardware and improved design. The device is expected to go on sale in early 2015, with prices starting at $349.", "wordchoice": ["unveil", "to", "sensors", "and", "GPS", "size", "Watch", "on", "with", "features", "the", "Reuters"], "title": "future Apple Watch versions to offer richer health features"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/LpKx0jKHGhQ/", "corpus": "These templates will help you decide which iPhone 6 size is right for you\n\nOn its website, Apple says that the iPhone 6 is 5.44 inches (138.1 mm) tall, 2.64 inches wide and 0.27 inches thick. The larger iPhone 6 Plus is 6.22″ x 3.06″ x 0.28″. These numbers are great, but they don’t really give you a good idea of how big these devices actually are, so we decided to try something else.\n\nSome templates have been floating around the web for the past few days, showing skeleton models of the iPhone 6 and 6 Plus using the above dimensions. The idea is for you to print these models out and compare them to other items, and we thought a good point of reference for scale would be the iPhone 5s.\n\nHere is the iPhone 6 (which has a 4.7-inch display) template compared to an iPhone 5s:\n\n\n\n Admittedly, it’s not the best photo, but it should give you an idea of how the size of an iPhone 6 compares to the 5s. It’s worth noting that I have lined up the very bottom of both devices—not their displays—as I felt that this would give me a more accurate look at the difference in the total footprint of each handset.\n\nNow, here’s the iPhone 6 Plus (with a 5.5-inch display) template compared to the iPhone 5s:\n\nOh yeah, it’s big. You can almost fit the entire body of the iPhone 5s within the display area of the 6 Plus. I’ve heard from people around the web who’ve seen the device up close say that it’s about the size of a checkbook, and that seems about right. It definitely looks like most tasks are going to require 2 hands.\n\nFor those of you who want to try this little experiment out for yourself, you can find the templates for the iPhone 6 and the iPhone 6 Plus here. It might just help you make your decision on which one to go with before you pre-order, which begins at 12:01 am tonight, or line up at Apple retail stores next Friday.", "wordchoice": ["device", "or", "items", "Friday", "floating", "out", "5", "few", "to", "iPhone", "ve", "that"], "title": "These templates will help you decide which iPhone 6 size is right for you"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/fcgrzKs6VR0/", "corpus": "The App Switcher, one of the most frequently used feature on iOS 7, can be accessed by double pressing the Home button. If you ever wanted to access the App Switcher from Control Center, you might want to check out a new jailbreak tweak known as CSwitcher.\n\nDeveloped by Brogan Miner, CSwitcher replaces the Quick Launch apps in Control Center with the App Switcher, allowing you to take a quick glance at the apps running in the background directly from Control Center as well as close any of them. Personally, since I never use the Quick Launch apps, CSwitcher could be a good replacement.\n\nAfter installing the tweak, double pressing the Home button launches Control Center where you can view the App Switcher from the bottom section where the Quick Launch apps are originally located. Swiping CSwitcher left or right displays all the open apps. To kill any of them, simply tap and hold on an icon and a tiny ‘x’ button will appear on top of it. Pressing it will close the specific app.\n\nOnce you install CSwitcher, a new preference panel will be added to the Settings app. From there, you can enable or disable the tweak via the kill switch toggle, choose to view five apps instead of four, as well as enable or disable paging. If paging is disabled, you can continuously scroll through open apps without the page-like effect.\n\nYou’ll also find an ‘App Snapshots’ toggle at the bottom of the preference panel that allows you to switch between two views: app icons and app preview cards. Once you’re done with the configurations, simply press the ‘Apply’ button for the changes to take place.\n\nThat’s all the tweak offers and if you find it more convenient accessing the App Switcher from Control Center, you should probably check out CSwitcher. As mentioned earlier, the tweak can be a good replacement to the Quick Launch apps if you don’t use them frequently.\n\nCSwitcher can be download from Cydia’s BigBoss repository for free and requires iOS 7 to work.", "wordchoice": ["Settings", "background", "offers", "by", "enable", "glance", "Snapshots", "an", "download", "Once", "can", "you"], "title": "CSwitcher brings your App Switcher to Control Center"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/1Z4bxhn0TTQ/", "corpus": "Apple to allow in-store pickups for iPhone 6 pre-orders\n\nIt looks like Apple will be giving folks who pre-order the iPhone 6 and 6 Plus the option to pick up their devices in-store, rather than having to wait for them to be shipped to their houses. The retail iPhone page on Apple’s website invites users to pre-order the new handset, and choose to “have it shipped to you for free, or pick it up in store.”\n\n9to5Mac says it has confirmed the news with several Apple Stores and representatives. Apparently the option to pickup the new iPhone in store will be available during the pre-order checkout process, and Apple will be setting up a second line for Personal Pickup at each of their stores on September 19th, when the handset officially goes on sale.\n\nApple doesn’t typically give customers the in-store pickup option during major product pre-orders, or even on launch day, but it has in the past. For example, I was able to request Personal Pickup when pre-ordering the iPad Air, and my experience was fairly similar to the one described above. I was in and out of the store within 20 minutes.\n\nWe’ll obviously know more about the process when it goes live tonight at 12:01 a.m. If you’ve never pre-ordered an Apple device before, or could use a refresher course on the matter, checkout our Survival Guide. We will let you know as soon as iPhone 6 pre-orders become available tonight, and keep you updated on carrier/model availability.", "wordchoice": ["of", "goes", "the", "one", "pre", "the", "past", "for", "to", "orders", "19th", "process"], "title": "Apple to allow in-store pickups for iPhone 6 pre-orders"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/s_BJvpep0_8/", "corpus": "Taptaptap teases Camera+ 6 with manual controls and other new features\n\nAhead of the release of the new iPhone 6, and its upgraded camera, and iOS 8 with its various new features, Taptaptap has begun teasing a major update for Camera+. Called Camera+ 6, the update will bring about manual controls and several other new features.\n\nThe new manual controls are split into 2 groups: “Shutter Priority” and “Full Manual control.” The former allows you to set your shutter speed, while the camera sets the ISO, and the latter allows you to customize both settings without any software intervention.\n\nAdditionally, there’s also a new Macro mode for taking up-close photos, and new white balance and focus options. It will also be taking advantage of iOS 8‘s new ‘Extensions’ feature, enabling users to edit their photos in Camera+ from within the stock Photos app.\n\nCombine all of these new features with the enhanced camera in iPhone 6, and you have the makings of a great mobile photography setup. Remember, the iPhone 6 adds 1.5-micron pixels and ƒ/2.2 aperture, and an all-new image sensor. It goes on sale next Friday.\n\niOS 8 launches to the public on September 17th, and we will be sure to let you know when Camera+ 6 becomes available.", "wordchoice": ["set", "launches", "launches", "for", "taking", "Camera", "advantage", "features", "its", "from", "new", "upgraded"], "title": "Taptaptap teases Camera+ 6 with manual controls and other new features"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/r9nCeIXMu-k/", "corpus": "Bicolor goes free as Apple’s App of the Week\n\nFolks who missed the opportunity to grab Bicolor when it was offered for free in the Apple Store app will be happy to hear that it’s gone on sale again. Apple is offering the popular game for free from now through next Thursday as part of its App of the Week promotion.\n\nFor those unfamiliar with the title, Bicolor is a deceptively-complex puzzler that tasks players with solving 240 handmade puzzles. In each level you must figure out how to draw a path with one color, and then cover it up with another using the right amount of moves.\n\nIn its Editors’ Notes section, Apple calls Bicolor a “fascinatingly minimal game, that will keep you captivated with intriguing controls, euphoria-inducing audio design, and deceptively difficult puzzles.” It adds that it’s incredibly easy to learn, but very difficult to master.\n\nHere’s a video of the game in action:\n\nAdmittedly, the game is a little intimidating and tough to understand before playing it, but once you get into the tutorial it’s easy to catch on. We named Bicolor one of our Apps of the Week in May, and we think it’s definitely worth grabbing from the App Store while it’s free.", "wordchoice": ["with", "adds", "be", "for", "In", "game", "tough", "and", "section", "to", "its", "Apple"], "title": "Bicolor goes free as Apple’s App of the Week"}, {"url": "http://feedproxy.google.com/~r/iphonedlb/~3/yxZNmNQqiR0/", "corpus": "The survival guide to pre-ordering your iPhone 6\n\nUnlike last year, Apple will let you pre-order your iPhone 6 or iPhone 6 Plus tonight, starting at 12.01 am PT. If our recent poll is any indication, it seems that almost twice as many people will pre-order the phone rather than wait in line next Friday to buy it directly from an Apple Store or one of the authorized retailers.\n\nPre-ordering has both its advantages and its drawbacks, so you should carefully weight your options before making a decision. To help you out, we’ve created this survival guide to pre-ordering your iPhone 6 where we share some simple tips on how to prepare for tonight.\n\nWhy would you want to pre-order in the first place? While some of us have good excuses such as having to show up at work on time, the main benefit of pre-ordering is that you won’t have to wait for several hours in line when the iPhone 6 becomes available in stores on September 19. If your pre-order goes through, you’re assured to secure a device which will be delivered to you on September 19.\n\nThat is of course if you’re able to pre-order on time. It is not unusual to see pre-order delivery times fall from the actual launch date to several days. Typically, if your pre-order goes through within a few hours of the kick off time, you’re likely to receive your device on September 19. If you wait too long, you risk to see that delivery time pushed back. Time is of the essence, so the sooner you can place this pre-order, the better your chances.\n\nNo matter what happens, you’ll know when you will receive your device as pre-order confirmations always show an estimated delivery date, which is fairly accurate.\n\nAssuming you’re able to pre-order and get confirmation that you will receive your device on September 19, you’ll have to make sure that you’re home to receive the package from FedEx or UPS, or that you sign up a waiver allowing the carrier to leave the package at your door if you’re not present to sign. When your iPhone ships, you will receive a tracking number with instructions on how to let the delivery guy know it is ok for him to leave the package at your door.\n\nPre-ordering and having your iPhone shipped to you is all great, but from my experience, it’s also been pretty nerve wracking and frustrating. I used to pre-order my devices because of the convenience, but because my area is last on the delivery route, I would always get my package at the end of the day, making me wait all day for the precious device to arrive. First world problems, you might say, rightfully so. Still, I specifically remember the year the iPhone 5 launched. I walked by my local AT&T store and realized only a handful of people were in line. I could have lined up with everybody else and most likely get my phone in an hour or so. But because I had pre-ordered, I had to go back home and wait for FedEx to come. The FedEx guy didn’t show up until 4pm that day. Since that day, I have said no to pre-orders.\n\nI’m not trying to convince you pre-ordering is not a good option. I’m merely trying to warn you it has some downsides too. If you decide to go ahead and pre-order, then read on for more tips.\n\nBefore you get too excited about pre-ordering your iPhone 6, you have to make sure you find out what price you’re going to pay for it. If you bought your previous iPhone (or other smartphone) two years ago, then you are eligible for an upgrade. If you bought last year’s iPhone 5s, then you’re probably not eligible for an upgrade. Either way, you want to make sure what your status is before tonight so that there is no surprise when time comes to pre-order.\n\nEarlier today, we published a short guide on how to check your iPhone upgrade eligibility where we highlight several options for you to check your status. Unless you’re positive you’re eligible for an upgrade, I’d advise you to check it out to make sure what your options are comes midnight tonight.\n\nThe pre-ordering start time is a pretty hectic time and you don’t want to waste precious seconds figuring out what model, what finish, and what storage option you want. If you’re going to be pre-ordering your device tonight, you must figure out all the details of your pre-order now. It means you must make up your mind about either getting the iPhone 6, or iPhone 6 Plus. You must make a decision about the finish of the device, and finally, you must make sure you know exactly how much storage space you want for your iPhone.\n\nIt sounds like a non-issue, but again, you don’t want to waste time weighting your options when pre-orders go live. When they go live, you must be ready to click as quick as possible to select what you want and wrap up your order. Remember, a few seconds can make a big difference in the end, and those 30 seconds you took to decide between silver or gold could mean you will receive your iPhone 6 on September 22 instead of September 19.\n\nDepending on your sleeping habits and where you live, you’ll have two options when it comes to making sure you’re behind your computer at 12.01 am PT tonight. You can either decide to stay awake, or go to sleep for a few hours and set an alarm to ring a few minutes before the T time.\n\nI live in California, so in previous years, I would simply stay up until midnight and go to bed once I had pre-ordered. But if you live on the East coast for example, 12.01am PT is 3.01am ET for you. It might be a little hard to stay up that late (again, it also depends on your sleeping habits). If that’s the case, I would definitely decide to go to bed, set an alarm for 15 minutes before pre-orders start, and get up then.\n\nOnce again, only you can make that decision. If you’re anything like me, also keep in mind that the excitement of the pre-order launch might actually prevent you from sleeping anyway.\n\nAs previously mentioned, pre-orders will go live at 12.01 am PT. That’s 2.01 am CT, and 3.01 am ET.\n\nAs far as we know, only Apple and carriers are taking pre-orders for the iPhone 6 at this time. Although Best Buy, RadioShack, Walmart, and other retailers are authorized Apple retailers, there is no indication on these companies’ website that they will be taking pre-orders. Target, who’s also an authorized retailer notes on its website that pre-orders will be available “in stores” on September 12. This means you won’t be able to pre-order from Target’s website, but you’ll be able to pre-order from a physical store.\n\nThis leaves us with only a few options to pre-order: Apple, or the carriers.\n\nGoing through Apple’s site is a no brainer for most people. After all, who better than the maker of the iPhone itself can better serve you? And that’s mostly right. The experience of pre-ordering a device on Apple’s website is much better than that of a carrier’s site. However, from previous experience, I’ve found that Apple’s site gets slammed with so much traffic that it can make it for a terrible experience too, with pages taking forever to load, or simply returning errors. While this was more true a few years ago than it is today, pre-ordering a device from Apple’s site from day one can prove to be a rocky road.\n\nIn the past, when Apple’s site was buried under massive amounts of traffic, I’ve found AT&T’s site to be more reliable. If I was to pre-order tonight, I would most likely go through AT&T. Fanboys might scream “blasphemy,” but it doesn’t matter. What matters is getting your pre-order in as quick and as reliably as possible.\n\nFor your convenience, here is where you can pre-order your iPhone from tonight:\n\nIt appears that pre-ordering via Apple’s website will give you the option to pick up your device in store on September 19. Although most stores might not participate, you will see an option to pick up your device in an Apple Store at the time of your pre-order. That could be a definite plus, compared to waiting for the FedEx guy. But keep in mind that you likely won’t be the only one having chose this option, and you’ll probably have to wait in line to get your device anyway.\n\nI clearly remember last time I pre-ordered an iPhone. I was frenetically refreshing my browser, waiting for the pre-order screen to go live, when all the sudden, I saw a river of tweets telling pre-orders were live. A bunch of refreshes later, and I was still not seeing the pre-order screen. As it turned out, my browser had cached the web page and was serving me page that was a few minutes old. I could have cleared the cache, but I decided that opening a different browser would probably be quicker. I launched Chrome and went with my pre-order. These were a few seconds that I could have saved. It didn’t have an impact of the final pre-order, but it could have, so be prepared.\n\nMy advice is to use your main browser, and if things don’t show on time, try launching a different browser as I did.\n\nOne of the most annoying things about buying online is that you have to fill out forms. Fill in your name, address, email, credit card number, expiration date, security code, etc… This is something that Apple Pay will most definitely fix in the future, but unfortunately we aren’t there quite yet, which is why you must be prepared.\n\nI personally use TextExpander where I created dozens of shortcuts for my personal information and my credit cards details. This way, when I buy something online, I can fill out the forms more quickly than I would if I had to type it all in. Typing a credit card number can be tedious, so be ready.\n\nIf you don’t use TextExpander, what you can do is open a text editor and type in your details prior to the pre-order launch. This way, you could quickly copy/paste some of your information  (ie. credit card number) without losing too much time. Once again, every second counts!\n\nNow that you are ready for tonight, it is time to sit back and relax. However you decide to place your pre-order, you are now equipped for the T time.\n\nBefore the pre-orders go live, make sure to keep a close look on Twitter, because you never know what can happen. A few years ago, pre-orders accidentally went live a few minutes before the scheduled time. It was a nice surprise indeed, and those who were keeping a close eye to their Twitter stream were able to rip the benefits of it, with their pre-orders going through before everybody else.\n\nBecause Apple and carriers have been having issues with pre-orders in the past, I assume that they have worked out many of the reasons why sites would crash or return errors due to heavy traffic. I’m confident that this year will be the smoothest pre-order launch to date. See what I’m doing? I’m being positive here because stressing out won’t change a thing.\n\nYippee! Your pre-order went through. Congratulations. Now it’s time to go to bed. I know it’s hard because your head and belly are filled with excitement, but it will wear off.\n\nIf you are pre-ordering your iPhone, please make sure to come by iDB and share your experience with us. We love to hear your anecdotes!", "wordchoice": ["and", "order", "then", "now", "how", "ordering", "and", "guide", "package", "before", "you", "Buy"], "title": "The survival guide to pre-ordering your iPhone 6"}]