[{"url": "http://feedproxy.google.com/~r/TheIphoneBlog/~3/pCFAtAxoZ8I/story01.htm", "corpus": "Deal of the Day Fri 12th Sep 2014 Only while stocks last!\n\nBodyGuardz HD Anti-glare ScreenGuardz are custom designed to protect your iPhone 5C, iPhone 5S, or iPhone 5 screen while reducing annoying glare at the same time.\n\nScreenGuardz is designed to custom fit the iPhone 5C, iPhone 5S, or iPhone 5. These invisible protectors are made of an ultra-slim polymer and shield your screen from abrasive elements such as keys and dust. ScreenGuardz is the ideal accessory to go along with your iPhone 5C, iPhone 5S, or iPhone 5 case, cover or protector.\n\nPlease Note: Product images, including color, may differ from actual product appearance.\n\nPromotional Pricing: Coupons are not eligible for this product today.", "wordchoice": ["reducing", "Promotional", "or", "polymer", "are", "time", "These", "your", "with", "5C", "These", "ScreenGuardz"], "title": "BodyGuardz HD Anti-glare ScreenGuardz for iPhone 5C, iPhone 5S, iPhone 5"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/yUX7unDLAJk/iphone-6-reservation-window-pre-ordering.html", "corpus": "With so much anticipation surrounding the iPhone 6 and iPhone 6 Plus, it was perhaps to be expected that there were going to be some kinks in the pre-ordering process that kicked off at 12:01 AM Pacific this morning. Fortunately, for customers that were unable to pre-order the iPhone 6 due to carrier issues, Apple has provided a 24-hour reservation window to proceed with the order.\n\nInstead of receiving a purchase confirmation from Apple, these customers have received a reservation number that for the iPhone model that was attempted to be pre-ordered that could be used when carrier systems were working properly again. Now that hours have passed and the pre-order rush has inevitably slowed down, Apple has notified affected customers by email to complete their orders.\n\nA significant portion of the emails have a 24 hour time window, while others are dated for the morning of September 14th. Apple will remove the reserved iPhone from their system if the transaction is not completed within the stated timeframe. In that case, customers will have to camp out at Apple Stores or authorized resellers ahead of the September 19th launch for their best chance at securing a new iPhone 6.\n\nThere is no doubt that the iPhone 6 and iPhone 6 Plus will likely be two of the hottest selling smartphones this holiday shopping season, particularly because they are the first iPhones to have large screen sizes akin to Android-based smartphones like the Samsung Galaxy S5 and Samsung Galaxy Note. Moreover, the iPhone 6 is a more noteworthy update compared to the iPhone 5s and could prompt more old iPhone users to upgrade.\n\nApple introduced the iPhone 6 at its product event on Tuesday afternoon. The company and carriers began accepting pre-orders for the smartphones on September 12th with a public launch to follow on September 19th in the United States, France, Hong Kong, Canada, Germany, Singapore, the United Kingdom, Australia and Japan, and several other countries on September 26th.\n\nWere you able to pre-order the iPhone 6?", "wordchoice": ["based", "with", "two", "pre", "more", "smartphones", "customers", "ahead", "received", "and", "to", "Samsung"], "title": "Apple offers 24-hour reservation window to iPhone 6 customers with pre-ordering issues"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/07dTkHy6zfM/ios-8s-sms-continuity-delayed.html", "corpus": "iOS 8 adds a number of new features to iPhones and iPads, but one that I was particularly looking forward to was SMS Continuity, which would let users reply to standard SMSes from their Macs and iPads as long as the iPhone is nearby.\n\nIt turns out that the feature is delayed until October, according to Apple’s updated webpage on iOS 8’s Continuity features.\n\nContinuity relies on Bluetooth and Wi-Fi, and we suspect that the delay has got to do something with OS X Yosemite, which is still in beta and won’t be releasing until October. The feature was live in iOS 8 betas, but has been disabled in iOS GM. The ability to receive and make phone calls from iPad and Mac, another Continuity feature, appears to be unaffected.\n\nHave you been able to to use SMS continuity with iOS 8 GM? Let us know in the comments below.", "wordchoice": ["Continuity", "ability", "the", "I", "to", "GM", "new", "X", "beta", "one", "8", "that"], "title": "iOS 8's SMS Continuity feature delayed till October"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/VbVYlqRsJw0/apple-sees-record-number-overnight-preorders-iphone-6-lineup.html", "corpus": "The iPhone 6 went up for preorder at 12:01 AM PST on Friday, September 12, and while AT&T’s CEO was quick to tout high numbers of their own, Apple has milestones of their own.\n\nIn a statement sent to Re/code, the Cupertino-based company confirmed that the iPhone 6 is indeed the sight of unprecedented desire from consumers, as the company has seen a “record number” of overnight preorders for the iPhone 6 lineup. Unfortunately, as is usual for this sort of thing at this stage in the game, no numbers have been provided.\n\n“An Apple representative said that the overnight sales of the new iPhones set a record, though Apple did not say how many have been sold. “Response to iPhone 6 and iPhone 6 Plus has been incredible with a record number of preorders overnight,” Apple told Re/code.“\n\nThe iPhone 6 is currently sold-out across the board, with shipping dates pushed back by several weeks. However, if you’re still in the market for a device, the 4.7-inch iPhone 6 seems to still be available.\n\nDid you preorder a device? Which one did you get?", "wordchoice": ["iPhone", "sight", "the", "iPhones", "the", "said", "in", "AM", "the", "own", "number", "iPhone"], "title": "Apple sees 'record number' of overnight preorders for iPhone 6 lineup"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/xw-v9KpEZcw/poll-iphone-6-pre-order.html", "corpus": "The iPhone 6 and iPhone 6 Plus pre-orders went live today, September 12, at 12:01AM PT.\n\nWhile Apple’s Online Store faced some issues, many of you were able to successfully place their orders for the iPhone 6. The Apple Online Store wasn’t the only way you could place pre-orders. There are other options like Apple’s Apple Store app, carrier websites as well as Walmart, Target, Best Buy and other retailer websites.\n\nIf you’ve managed to successfully place an order for the iPhone 6, tell us which iPhone — the iPhone 6 or iPhone 6 Plus — did you buy:\n\n\n\n Which iPhone 6 did you pre-order?\n\nApple changed the iPhone lineup storage configuration with 16GB, 64GB and 128GB options available, so tell us which storage configuration did you buy. Did the 16 to 64GB jump for an extra $100 push you toward the higher capacity model?\n\n\n\n Which storage capacity did you go for?\n\nThe iPhone 6 and iPhone 6 Plus are available in three colors: Gold, Silver and Space Gray. Tell us which one you bought in the poll below:\n\n\n\n Which color did you for?", "wordchoice": ["capacity", "Plus", "you", "order", "which", "order", "64GB", "which", "Store", "6", "jump", "colors"], "title": "Poll: Which iPhone 6 did you pre-order?"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/wKDFXMGNKyE/att-will-launch-wi-fi-calling-2015.html", "corpus": "Wi-Fi Calling isn’t a feature that’s non-existent at this point. It exists, and some carriers, like T-Mobile, even offer the feature now for many of their devices. But, thanks to a pair of events and a lot of attention, it’s surely about to take off.\n\nAccording to a report published by Light Reading, AT&T will be launching its own support for Wi-Fi Calling in 2015, but no exact dates were provided. Worse, from the report it sounds like AT&T will not be supporting it as broadly as other carriers will be in the coming months:\n\nAT&T’s attention on Wi-Fi Calling is a far cry from T-Mobile’s, which, just recently at their Un-carrier 7.0 event, made Wi-Fi Calling and Messaging a major feature point for the wireless network from this point on. Sprint, as well, offers devices with Wi-Fi Calling support already, as does Verizon. The latter will also be putting a bigger focus on advanced options for customers, including a bigger focus on Voice-over LTE (VoLTE).\n\nAnother part of the big focus on Wi-Fi Calling (and VoLTE), is the fact that Apple’s iPhone 6 and iPhone 6 Plus also support these options. When comparing networks to see which one is the best bet for you and your new iPhone, these features could be a differentiating factor depending on your area and network coverage.", "wordchoice": ["report", "coverage", "When", "s", "Fi", "T", "published", "coming", "far", "offers", "Un", "Wi"], "title": "AT&T will launch Wi-Fi Calling in 2015"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/X4bbOAGqm90/att-already-taken-hundreds-thousands-preorders-iphone-6-lineup.html", "corpus": "Demand for the newest iPhones to get announced, the 4.7-inch iPhone 6 and the 5.5-inch iPhone 6 Plus, is pretty strong if preorder shipping estimates are any indication. If that’s not enough, though, AT&T’s CEO Ralph de la Vega has some impressive, if not vague, numbers already.\n\nDespite the fact that the iPhone 6 and iPhone 6 Plus went up for preorder beginning at 12:01 AM PST on September 12, AT&T’s top executive de la Vega has confirmed that the Big Blue carrier has already secured “hundreds of thousands” of preorders for the new devices:\n\n““It’s amazing to see the volume,” he said, adding that the “systems are rocking” and “everything is going well.” He said demand for the new phones is “better than last year and they’re better than the prior year [before that].” “Every time there is a change in [iPhone] design, there’s an uptake,” he said. “I think this design is particularly good.”“\n\nLeading up to the preorder window opening up for the new devices, many carriers, including AT&T, offered up trade-in offers for customers, allowing older handsets to be traded in for the newer devices. Many of which are still running, as the iPhone 6 and the iPhone 6 Plus launches on September 19.", "wordchoice": ["top", "opening", "get", "19", "a", "enough", "de", "trade", "including", "better", "devices", "re"], "title": "AT&T has already taken 'hundreds of thousands' of preorders for iPhone 6 lineup, according to de la Vega"}, {"url": "http://feeds.iphonehacks.com/~r/iphonehacks/~3/iqDhpt2rmMc/27-inch-retina-imac-with-5k-display-landing-end-of-2014.html", "corpus": "A 12-inch MacBook isn’t the only rumor that continues to fan the flames that power the Rumor Mill. The 27-inch Retina iMac with a high resolution has resurfaced, this time bumping the 4K resolution up to 5K for good measure.\n\nIn March of 2014, rumors started to take hold that Apple was working on a 4K display for their iMac lineup (after adding support for the resolution within OS X), and that the desktop could land sometime in 2014. Unfortunately, as these things tend to happen, no exact dates could be provided at the time. And that’s still the case now, even as the 4K display gets bumped up to 5K.\n\nThe report was originally published by Taiwan-based WitsView, a company that researches display and keeps a sharp eye on the supply chains all over the world for many major companies. The report states that Apple is currently in the works to release their first 5K Retina iMac, and that they are planning on launching it by the end of 2014.\n\nThe report does have support in the fact that Dell did just announce a 5K panel of their own, with a resolution of 5120 x 2880. It’s a 27-inch display, too, which could coincide with plans on Apple’s end. Without any dates to circle on the calendar, though, it’s still just a revolving rumor at this point.", "wordchoice": ["the", "too", "5K", "the", "display", "12", "and", "with", "5120", "after", "good", "report"], "title": "27-inch Retina iMac with 5K display reportedly landing by end of 2014"}]